Get a copy of the second edge or curve reference.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Reference GetEdgeReference2()
  Visual Basic
Public Function GetEdgeReference2 As Reference
  Visual C++
public:
Reference^ GetEdgeReference2()
 See Also
  PointOnEdgeEdgeIntersection Class
  Autodesk.Revit.DB Namespace